/*
MySQL Data Transfer
Source Host: localhost
Source Database: l1jdb
Target Host: localhost
Target Database: l1jdb
Date: 2012/06/23 11:44:20
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for spawnlist_boss
-- ----------------------------
DROP TABLE IF EXISTS `spawnlist_boss`;
CREATE TABLE `spawnlist_boss` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `location` varchar(45) NOT NULL DEFAULT '',
  `cycle_type` varchar(20) NOT NULL DEFAULT '',
  `count` int(10) unsigned NOT NULL DEFAULT '0',
  `npc_id` int(10) unsigned NOT NULL DEFAULT '0',
  `group_id` int(10) unsigned NOT NULL DEFAULT '0',
  `locx` int(10) unsigned NOT NULL DEFAULT '0',
  `locy` int(10) unsigned NOT NULL DEFAULT '0',
  `randomx` int(10) unsigned NOT NULL DEFAULT '0',
  `randomy` int(10) unsigned NOT NULL DEFAULT '0',
  `locx1` int(10) unsigned NOT NULL DEFAULT '0',
  `locy1` int(10) unsigned NOT NULL DEFAULT '0',
  `locx2` int(10) unsigned NOT NULL DEFAULT '0',
  `locy2` int(10) unsigned NOT NULL DEFAULT '0',
  `heading` int(10) unsigned NOT NULL DEFAULT '0',
  `mapid` int(10) unsigned NOT NULL DEFAULT '0',
  `respawn_screen` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `movement_distance` int(10) unsigned NOT NULL DEFAULT '0',
  `rest` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `spawn_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `percentage` tinyint(3) unsigned NOT NULL DEFAULT '100',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=467 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `spawnlist_boss` VALUES ('400', '彩雲のオルバ', 'Caspa', '0', '100107', '0', '32767', '32863', '0', '0', '32704', '32768', '32831', '32959', '3', '7057', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('401', '深森のウィノア', 'Caspa', '0', '100108', '0', '32767', '32863', '0', '0', '32704', '32768', '32831', '32959', '3', '7057', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('402', '下愚バパール', 'Caspa', '1', '100065', '0', '32735', '32863', '0', '0', '32576', '32704', '32895', '33023', '3', '535', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('403', '騎士アガレス', 'Caspa', '2', '100066', '0', '32735', '32863', '0', '0', '32576', '32704', '32895', '33023', '3', '535', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('404', '激昂のアーバイン', 'Caspa', '1', '100067', '0', '32735', '32863', '0', '0', '32576', '32704', '32895', '33023', '3', '535', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('405', '秘色のブルタコス', 'Caspa', '0', '100099', '0', '32767', '32831', '0', '0', '32704', '32768', '32831', '32895', '3', '610', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('406', '弓使いアロセール', 'Caspa', '1', '100132', '0', '32767', '32831', '0', '0', '32704', '32768', '32831', '32895', '3', '610', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('407', '滅紫のガノン', 'Caspa', '1', '100133', '0', '32767', '32831', '0', '0', '32704', '32768', '32831', '32895', '3', '610', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('411', '吃音のブレッゼン', 'Caspa', '1', '100086', '0', '32767', '32767', '0', '0', '32704', '32704', '32831', '32831', '3', '611', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('412', '毒牙のラミドス', 'Caspa', '1', '100087', '0', '32767', '32767', '0', '0', '32704', '32704', '32831', '32831', '3', '611', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('413', '祈りのガズン', 'Caspa', '1', '100088', '0', '32767', '32767', '0', '0', '32704', '32704', '32831', '32831', '3', '611', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('414', '灰白のルロッツァ', 'Caspa', '1', '100125', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '7001', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('415', '騎士リューモス', 'Caspa', '1', '100080', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '7001', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('416', '賞金稼ぎザパン', 'Caspa', '1', '100081', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '7001', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('417', '大地の魔術師シェリー', 'Caspa', '2', '100119', '0', '32639', '32639', '0', '0', '32512', '32512', '32767', '32767', '3', '7002', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('418', '暗紅のハイラム', 'Caspa', '2', '100082', '0', '32639', '32639', '0', '0', '32512', '32512', '32767', '32767', '3', '7002', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('419', '黄土のグアチャロ', 'Caspa', '1', '100084', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '67', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('420', '勇躍のオルゲウ', 'Caspa', '1', '100085', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '67', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('421', '障碍のジルドア', 'Caspa', '1', '100068', '0', '32735', '32799', '0', '0', '32640', '32704', '32831', '32895', '3', '67', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('422', '人斬りハンゾウ', 'Caspa', '2', '100069', '0', '32799', '32735', '0', '0', '32640', '32576', '32959', '32895', '3', '7053', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('423', '鉄紺のウラム', 'Caspa', '1', '100116', '0', '32799', '32735', '0', '0', '32640', '32576', '32959', '32895', '3', '7053', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('424', '怒りのモディリアーニ', 'Caspa', '1', '100117', '0', '32799', '32735', '0', '0', '32640', '32576', '32959', '32895', '3', '7053', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('425', '枯色のカムラット', 'Caspa', '1', '100118', '0', '32639', '32959', '0', '0', '32512', '32832', '32767', '33087', '3', '777', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('426', '焦香のビンガム', 'Caspa', '1', '100122', '0', '32639', '32959', '0', '0', '32512', '32832', '32767', '33087', '3', '777', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('427', '東雲のカークリノーラス', 'Caspa', '1', '100123', '0', '32639', '32959', '0', '0', '32512', '32832', '32767', '33087', '3', '777', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('428', '無念のディダーロ', 'Caspa', '1', '100124', '0', '32639', '32959', '0', '0', '32512', '32832', '32767', '33087', '3', '777', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('434', '砂漠のロボス', 'Caspa', '1', '100126', '0', '32640', '32959', '0', '0', '32576', '32831', '32704', '33087', '3', '780', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('435', '暗黒騎士バルバス', 'Caspa', '1', '100073', '0', '32640', '32959', '0', '0', '32576', '32831', '32704', '33087', '3', '780', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('436', '暗黒騎士ランスロット', 'FF', '1', '100139', '0', '32640', '32959', '0', '0', '32576', '32831', '32704', '33087', '3', '780', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('437', '竜使いハルファス', 'Caspa', '1', '100111', '0', '32895', '32543', '0', '0', '32832', '32448', '32959', '32639', '3', '300', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('438', '騎士グランディエ', 'Caspa', '1', '100112', '0', '32895', '32543', '0', '0', '32832', '32448', '32959', '32639', '3', '300', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('439', '騎士ヴェルマドワ', 'Caspa', '1', '100113', '0', '32895', '32543', '0', '0', '32832', '32448', '32959', '32639', '3', '300', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('440', '騎士ラウアール', 'Caspa', '1', '100115', '0', '32895', '32543', '0', '0', '32832', '32448', '32959', '32639', '3', '300', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('441', '司祭ブランタ', 'Caspa', '1', '100114', '0', '32895', '32543', '0', '0', '32832', '32448', '32959', '32639', '3', '300', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('442', '暗黒騎士アンドラス', 'Caspa', '2', '100075', '0', '32767', '32831', '0', '0', '32704', '32768', '32831', '32895', '3', '606', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('443', '暗黒騎士バールゼフォン', 'Caspa', '1', '100142', '0', '32831', '32959', '0', '0', '32704', '32832', '32959', '33087', '3', '7100', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('444', '暗黒騎士ヴォラック', 'Caspa', '1', '100143', '0', '32831', '32959', '0', '0', '32704', '32832', '32959', '33087', '3', '7100', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('445', '暗黒騎士バルバス', 'Caspa', '1', '100151', '0', '32831', '32959', '0', '0', '32704', '32832', '32959', '33087', '3', '7100', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('446', '暗黒騎士マルティム', 'Caspa', '1', '100074', '0', '32831', '32959', '0', '0', '32704', '32832', '32959', '33087', '3', '7100', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('447', 'ドルガルア王', 'FF', '1', '100063', '0', '32801', '32812', '0', '0', '0', '0', '0', '0', '3', '7012', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('448', '円舞', 'Caspa', '2', '100089', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '110', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('449', '青月', 'Caspa', '2', '100090', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '110', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('450', '金武', 'Caspa', '2', '100091', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '120', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('451', '烈空', 'Caspa', '2', '100092', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '120', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('452', 'ザエボス', 'Caspa', '1', '100148', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '130', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('453', 'レオナール', 'Caspa', '1', '100150', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '130', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('454', 'ザエボス', 'Caspa', '1', '100148', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '140', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('455', 'レオナール', 'Caspa', '1', '100150', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '140', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('456', '妖女ザドバ', 'Caspa', '2', '100098', '0', '32799', '32799', '0', '0', '32704', '32704', '32895', '32895', '3', '150', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('457', '魔女ベルゼビュート', 'Caspa', '2', '100095', '0', '32671', '32863', '0', '0', '32576', '32768', '32767', '32959', '3', '160', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('458', '白魔道士ヴェパール', 'Caspa', '0', '100097', '0', '32671', '32863', '0', '0', '32576', '32768', '32767', '32959', '3', '170', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('459', '毒使いファルファデ', 'Caspa', '2', '100096', '0', '32671', '32863', '0', '0', '32576', '32768', '32767', '32959', '3', '180', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('460', '屍術師ニバス', 'FF', '0', '100093', '0', '32671', '32863', '0', '0', '32576', '32768', '32767', '32959', '3', '190', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('461', 'ブラックモア', 'FF', '0', '100094', '0', '32703', '32895', '0', '0', '32576', '32768', '32831', '33023', '3', '200', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('466', '天空のギルバルド', 'FF', '1', '100537', '0', '32765', '32898', '0', '0', '0', '0', '0', '0', '0', '2003', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('465', '魔女デネブ', 'FF', '1', '100536', '0', '32744', '32758', '0', '0', '0', '0', '0', '0', '0', '2002', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('464', '剣聖ハボリム', 'FF', '1', '100535', '0', '32799', '32765', '0', '0', '0', '0', '0', '0', '0', '2001', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('463', '裏切りのヴァイス', 'FF', '1', '100534', '0', '32744', '32758', '0', '0', '0', '0', '0', '0', '0', '2000', '1', '120', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('462', '魔術師バイアン', 'FF', '1', '100533', '0', '32799', '32765', '0', '0', '0', '0', '0', '0', '0', '2000', '1', '120', '0', '0', '100');
